test-executive.org
* Appendices

**Appendix A: Full Financial Statements**
Available upon request.

**Appendix B: Technical Documentation**
Located in internal wiki.

**Appendix C: Market Research Data**
Compiled by External Insights LLC.

* Meeting Notes

**Board Meeting - March 2026**

*Attendees:*
- Board Members: 8
- Executive Team: 5
- External Advisors: 2

*Key Decisions:*
1. Approved Q2 budget allocation
2. Authorized European expansion
3. Approved executive compensation plan
4. Scheduled investor relations day

**Action Items from Meeting:**

- TODO Prepare investor presentation by April 20
- DONE Distribute meeting minutes
- DOING Finalize board resolution documents
- TODO Schedule follow-up strategy session

* Contact Information

#+AUTHOR: John Executive
#+EMAIL: john.executive@company.com
#+PHONE: +1 (555) 123-4567

**Office Hours:** Monday - Friday, 9:00 AM - 5:00 PM EST

---
*Confidential - For Internal Use Only*
Document Version: 1.2 | Last Updated: April 9, 2026

* Admonitions & Notes

** Important Notice

NOTE: This is an important note that requires attention.

** WARNING - Critical Alert

CAUTION: This is a warning that needs careful consideration.

** TIP - Helpful Hint

TIP: This is a helpful tip for better understanding.

** DANGER - Security Alert

DANGER: This is a critical security concern.

* Alignment Examples

** Center Aligned Content

#+CENTER: This text is center aligned and looks professional.

** Right Aligned Content

#+RIGHT: This text is right aligned for emphasis.

** Left Aligned Content

#+LEFT: This text is left aligned (default).

* Verse & Poetry

#+BEGIN_VERSE
The road not taken
Two roads diverged in a yellow wood,
And sorry I could not travel both
And be one traveler, long I stood
And looked down one as far as I could
#+END_VERSE

* Mathematical Expressions

The quadratic formula is:

#+BEGIN_MATH
x = (-b ± √(b² - 4ac)) / 2a
#+END_MATH

* Footnotes

This is a sentence with a footnote reference.[1]

And another with multiple references.[2][3]

[1] First footnote explanation
[2] Second footnote explanation  
[3] Third footnote explanation

* Tags & Flags

This is an example with [[#tag][tags]] and a [[#flag][flagged item]].

* Inline Task

#+BEGIN_INLINETASK
Title: Review Document
Deadline: 2026-04-15
Assigned: John Executive
Description: Please review all sections for accuracy.
#+END_INLINETASK

* Definition Lists

Term:: Definition of the term
      Additional explanation if needed.

Another Term:: Simple definition

* Emphasis Examples

*Bold text* for emphasis
_Italic text_ for notes
__Underline__ for important items

* Code Examples

** Shell Commands

#+BEGIN_SRC bash
#!/bin/bash
# Server monitoring script
echo "Checking system status..."
uptime
df -h
#+END_SRC

** Python Code

#+BEGIN_SRC python
def executive_report(data):
    """Generate executive summary report."""
    return {
        'status': 'success',
        'metrics': calculate_kpis(data),
        'recommendations': generate_actions(data)
    }
#+END_SRC

* Tables with Special Formatting

#+BEGIN_CENTER
| Feature          | Status  | Priority |
|------------------+---------+----------|
| Security Audit   | DONE    | Critical |
| Performance Test | TODO    | High     |
| User Testing     | DOING   | Medium   |
#+END_CENTER

* Admonitions & Notes

** Important Notice

NOTE: This is an important note that requires attention.

** WARNING - Critical Alert

CAUTION: This is a warning that needs careful consideration.

** TIP - Helpful Hint

TIP: This is a helpful tip for better understanding.

** DANGER - Security Alert

DANGER: This is a critical security concern.

* Alignment Examples

** Center Aligned Content

#+CAPTION: Center aligned content

** Right Aligned Content

** Left Aligned Content

* Verse & Poetry

#+BEGIN_VERSE
The road not taken
Two roads diverged in a yellow wood,
And sorry I could not travel both
And be one traveler, long I stood
And looked down one as far as I could
#+END_VERSE

* Mathematical Expressions

The quadratic formula is:

#+BEGIN_MATH
x = (-b ± √(b² - 4ac)) / 2a
#+END_MATH

* Footnotes

This is a sentence with a footnote reference.[1]

And another with multiple references.[2][3]

[1] First footnote explanation
[2] Second footnote explanation  
[3] Third footnote explanation

* Tags & Flags

This is an example with tags and flagged items.

* Inline Task

#+BEGIN_INLINETASK
Title: Review Document
Deadline: 2026-04-15
Assigned: John Executive
Description: Please review all sections for accuracy.
#+END_INLINETASK

