test-executive.html
<div id="outline-container-org714fa22" class="outline-2">
<h2 id="org714fa22"><span class="section-number-2">8.</span> Appendices</h2>
<div class="outline-text-2" id="text-8">
<p>
<b><b>Appendix A: Full Financial Statements</b></b>
Available upon request.
</p>

<p>
<b><b>Appendix B: Technical Documentation</b></b>
Located in internal wiki.
</p>

<p>
<b><b>Appendix C: Market Research Data</b></b>
Compiled by External Insights LLC.
</p>
</div>
</div>
<div id="outline-container-org0b5bd58" class="outline-2">
<h2 id="org0b5bd58"><span class="section-number-2">9.</span> Meeting Notes</h2>
<div class="outline-text-2" id="text-9">
<p>
<b><b>Board Meeting - March 2026</b></b>
</p>

<p>
<b>Attendees:</b>
</p>
<ul class="org-ul">
<li>Board Members: 8</li>
<li>Executive Team: 5</li>
<li>External Advisors: 2</li>
</ul>

<p>
<b>Key Decisions:</b>
</p>
<ol class="org-ol">
<li>Approved Q2 budget allocation</li>
<li>Authorized European expansion</li>
<li>Approved executive compensation plan</li>
<li>Scheduled investor relations day</li>
</ol>

<p>
<b><b>Action Items from Meeting:</b></b>
</p>

<ul class="org-ul">
<li>TODO Prepare investor presentation by April 20</li>
<li>DONE Distribute meeting minutes</li>
<li>DOING Finalize board resolution documents</li>
<li>TODO Schedule follow-up strategy session</li>
</ul>
</div>
</div>
<div id="outline-container-org725f3de" class="outline-2">
<h2 id="org725f3de"><span class="section-number-2">10.</span> Contact Information</h2>
<div class="outline-text-2" id="text-10">
<p>
<b><b>Office Hours:</b></b> Monday - Friday, 9:00 AM - 5:00 PM EST
</p>

<p>
&#x2014;
<b>Confidential - For Internal Use Only</b>
Document Version: 1.2 | Last Updated: April 9, 2026
</p>
</div>
</div>
<div id="outline-container-orgc5cdd7c" class="outline-2">
<h2 id="orgc5cdd7c"><span class="section-number-2">11.</span> Admonitions &amp; Notes</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org624964c" class="outline-3">
<h3 id="org624964c"><span class="section-number-3">11.1.</span> Important Notice</h3>
<div class="outline-text-3" id="text-11-1">
<p>
NOTE: This is an important note that requires attention.
</p>
</div>
</div>
<div id="outline-container-orgfb48bf5" class="outline-3">
<h3 id="orgfb48bf5"><span class="section-number-3">11.2.</span> WARNING - Critical Alert</h3>
<div class="outline-text-3" id="text-11-2">
<p>
CAUTION: This is a warning that needs careful consideration.
</p>
</div>
</div>
<div id="outline-container-org3e40c7e" class="outline-3">
<h3 id="org3e40c7e"><span class="section-number-3">11.3.</span> TIP - Helpful Hint</h3>
<div class="outline-text-3" id="text-11-3">
<p>
TIP: This is a helpful tip for better understanding.
</p>
</div>
</div>
<div id="outline-container-org95a1d26" class="outline-3">
<h3 id="org95a1d26"><span class="section-number-3">11.4.</span> DANGER - Security Alert</h3>
<div class="outline-text-3" id="text-11-4">
<p>
DANGER: This is a critical security concern.
</p>
</div>
</div>
</div>
<div id="outline-container-org03f13b3" class="outline-2">
<h2 id="org03f13b3"><span class="section-number-2">12.</span> Alignment Examples</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orge85c1c0" class="outline-3">
<h3 id="orge85c1c0"><span class="section-number-3">12.1.</span> Center Aligned Content</h3>
<div class="outline-text-3" id="text-12-1">
</div>
</div>
<div id="outline-container-orgc599a22" class="outline-3">
<h3 id="orgc599a22"><span class="section-number-3">12.2.</span> Right Aligned Content</h3>
<div class="outline-text-3" id="text-12-2">
</div>
</div>
<div id="outline-container-org058fe4b" class="outline-3">
<h3 id="org058fe4b"><span class="section-number-3">12.3.</span> Left Aligned Content</h3>
<div class="outline-text-3" id="text-12-3">
</div>
</div>
</div>
<div id="outline-container-org3099fe8" class="outline-2">
<h2 id="org3099fe8"><span class="section-number-2">13.</span> Verse &amp; Poetry</h2>
<div class="outline-text-2" id="text-13">
<p class="verse">
The road not taken<br>
Two roads diverged in a yellow wood,<br>
And sorry I could not travel both<br>
And be one traveler, long I stood<br>
And looked down one as far as I could<br>
</p>
</div>
</div>
<div id="outline-container-org1f014d2" class="outline-2">
<h2 id="org1f014d2"><span class="section-number-2">14.</span> Mathematical Expressions</h2>
<div class="outline-text-2" id="text-14">
<p>
The quadratic formula is:
</p>

<div class="MATH" id="org33755b5">
<p>
x = (-b ± √(b² - 4ac)) / 2a
</p>

</div>
</div>
</div>
<div id="outline-container-org98d5d6c" class="outline-2">
<h2 id="org98d5d6c"><span class="section-number-2">15.</span> Tags &amp; Flags</h2>
<div class="outline-text-2" id="text-15">
<p>
This is an example with and a .
</p>
</div>
</div>
<div id="outline-container-orgaf0b4cf" class="outline-2">
<h2 id="orgaf0b4cf"><span class="section-number-2">16.</span> Inline Task</h2>
<div class="outline-text-2" id="text-16">
<div class="INLINETASK" id="org0fd46ba">
<p>
Title: Review Document
Deadline: 2026-04-15
Assigned: John Executive
Description: Please review all sections for accuracy.
</p>

</div>
</div>
</div>
<div id="outline-container-org105ab6b" class="outline-2">
<h2 id="org105ab6b"><span class="section-number-2">17.</span> Definition Lists</h2>
<div class="outline-text-2" id="text-17">
<p>
Term:: Definition of the term
      Additional explanation if needed.
</p>

<p>
Another Term:: Simple definition
</p>
</div>
</div>
<div id="outline-container-org5c195d5" class="outline-2">
<h2 id="org5c195d5"><span class="section-number-2">18.</span> Emphasis Examples</h2>
<div class="outline-text-2" id="text-18">
<p>
<b>Bold text</b> for emphasis
<span class="underline">Italic text</span> for notes
<span class="underline"><span class="underline">Underline</span></span> for important items
</p>
</div>
</div>
<div id="outline-container-org76ec822" class="outline-2">
<h2 id="org76ec822"><span class="section-number-2">19.</span> Code Examples</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org5fc02e9" class="outline-3">
<h3 id="org5fc02e9"><span class="section-number-3">19.1.</span> Shell Commands</h3>
<div class="outline-text-3" id="text-19-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #d55e00; font-style: italic;">#</span><span style="color: #d55e00; font-style: italic;">!/bin/</span><span style="color: #f8ec59;">bash</span><span style="color: #d55e00; font-style: italic;">
</span><span style="color: #d55e00; font-style: italic;"># </span><span style="color: #d55e00; font-style: italic;">Server monitoring script
</span><span style="color: #fcfbe3;">echo</span> <span style="color: #ff00ff;">"Checking system status..."</span>
uptime
df -h
</pre>
</div>
</div>
</div>
<div id="outline-container-org12eb9f0" class="outline-3">
<h3 id="org12eb9f0"><span class="section-number-3">19.2.</span> Python Code</h3>
<div class="outline-text-3" id="text-19-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #f8ec59;">def</span> <span style="color: #56b4e9;">executive_report</span>(data):
    <span style="color: #e69f00;">"""Generate executive summary report."""</span>
    <span style="color: #f8ec59;">return</span> {
        <span style="color: #ff00ff;">'status'</span>: <span style="color: #ff00ff;">'success'</span>,
        <span style="color: #ff00ff;">'metrics'</span>: calculate_kpis(data),
        <span style="color: #ff00ff;">'recommendations'</span>: generate_actions(data)
    }
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf526af7" class="outline-2">
<h2 id="orgf526af7"><span class="section-number-2">20.</span> Tables with Special Formatting</h2>
<div class="outline-text-2" id="text-20">
<div class="org-center">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Priority</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Security Audit</td>
<td class="org-left">DONE</td>
<td class="org-left">Critical</td>
</tr>

<tr>
<td class="org-left">Performance Test</td>
<td class="org-left">TODO</td>
<td class="org-left">High</td>
</tr>

<tr>
<td class="org-left">User Testing</td>
<td class="org-left">DOING</td>
<td class="org-left">Medium</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org0e13e53" class="outline-2">
<h2 id="org0e13e53"><span class="section-number-2">21.</span> Admonitions &amp; Notes</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orge22013a" class="outline-3">
<h3 id="orge22013a"><span class="section-number-3">21.1.</span> Important Notice</h3>
<div class="outline-text-3" id="text-21-1">
<p>
NOTE: This is an important note that requires attention.
</p>
</div>
</div>
<div id="outline-container-org54e39d1" class="outline-3">
<h3 id="org54e39d1"><span class="section-number-3">21.2.</span> WARNING - Critical Alert</h3>
<div class="outline-text-3" id="text-21-2">
<p>
CAUTION: This is a warning that needs careful consideration.
</p>
</div>
</div>
<div id="outline-container-org32b5805" class="outline-3">
<h3 id="org32b5805"><span class="section-number-3">21.3.</span> TIP - Helpful Hint</h3>
<div class="outline-text-3" id="text-21-3">
<p>
TIP: This is a helpful tip for better understanding.
</p>
</div>
</div>
<div id="outline-container-org232d2be" class="outline-3">
<h3 id="org232d2be"><span class="section-number-3">21.4.</span> DANGER - Security Alert</h3>
<div class="outline-text-3" id="text-21-4">
<p>
DANGER: This is a critical security concern.
</p>
</div>
</div>
</div>
<div id="outline-container-org1619727" class="outline-2">
<h2 id="org1619727"><span class="section-number-2">22.</span> Alignment Examples</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-orgdc28cfd" class="outline-3">
<h3 id="orgdc28cfd"><span class="section-number-3">22.1.</span> Center Aligned Content</h3>
<div class="outline-text-3" id="text-22-1">
</div>
</div>
<div id="outline-container-orgd12cdce" class="outline-3">
<h3 id="orgd12cdce"><span class="section-number-3">22.2.</span> Right Aligned Content</h3>
</div>

<div id="outline-container-org7525678" class="outline-3">
<h3 id="org7525678"><span class="section-number-3">22.3.</span> Left Aligned Content</h3>
</div>
</div>
<div id="outline-container-orgf600179" class="outline-2">
<h2 id="orgf600179"><span class="section-number-2">23.</span> Verse &amp; Poetry</h2>
<div class="outline-text-2" id="text-23">
<p class="verse">
The road not taken<br>
Two roads diverged in a yellow wood,<br>
And sorry I could not travel both<br>
And be one traveler, long I stood<br>
And looked down one as far as I could<br>
</p>
</div>
</div>
<div id="outline-container-orgef7d39a" class="outline-2">
<h2 id="orgef7d39a"><span class="section-number-2">24.</span> Mathematical Expressions</h2>
<div class="outline-text-2" id="text-24">
<p>
The quadratic formula is:
</p>

<div class="MATH" id="orge14216d">
<p>
x = (-b ± √(b² - 4ac)) / 2a
</p>

</div>
</div>
</div>
<div id="outline-container-org78407b5" class="outline-2">
<h2 id="org78407b5"><span class="section-number-2">25.</span> Tags &amp; Flags</h2>
<div class="outline-text-2" id="text-25">
<p>
This is an example with tags and flagged items.
</p>
</div>
</div>
